Update README.md
PUML to Mermaid Changes
